/*=======================================================================*/
/*        I N C L U D E S                                                */
/*=======================================================================*/
#include "hglobal.h"
#include "ccstd.h"

/*============================================ ==================*/
/*        G L O B A L   D E F I N I T I O N S                     */
/*============================================= =================*/ 


/*******************
* STATIC DATA      *
********************/

static Byte  CCRows;            //Текущее значение строк и столбцов
static Byte  CCColumn; 
 
 
static Byte  CCMaxRows;                //Мах значения строк и столбцов
static Byte  CCMaxColumns;             //


/*==========================================================================*/
/* L O C A L   F U N C T I O N   P R O T O T Y P E S                        */
/*==========================================================================*/


/*==========================================================================*/
/* L O C A L   F U N C T I O N                                              */
/*==========================================================================*/

/*==========================================================================*/
/* G L O B A L      F U N C T I O N                                         */
/*==========================================================================*/

/*****************************************************************************
*
* НАЗВАНИЕ: pltstd_CCInit
* Инициализирует  дисплейный обьект перед использованием
*  
*
* Возвращает :  void
*
* Параметр    Flow    Описание
* ------------------------------------------------------------------ ----------
* Length        IN      Требемое число столбцов
* Height        IN      Требуемое число строк
* PageANotB     IN      Флаг, чтобы указать, предназначен ли OSD для страницы A или
*                                   страницы B дисплея (Действительно для Painter2 только)
******************************************************************************/
 
void pltstd_CCInit(Byte Length, Byte Height)
{
 	CCMaxColumns = Length; //Сохраняем в памяти запрашиваемое число столбцов
	CCMaxRows    = Height; //  и строк
}
 
/*******************************************************************************
* NAME: plt_CCSetPosition
* Устанавливает поицию дисплея для записи данных
*
* Returns :  void
*
* Параметр    Вх/Вых    Описание
* ------------------------------------------------------------------------------
-
* Row           IN      Строка начала записи информации OSD.
* Column        IN      Столбец записи информации OSD.
********************************************************************************/
 
void plt_CCSetPosition(Byte Row, Byte Column) 
{
CCRows = Row;      // Текущее значение строк 
CCColumn = Column;  // Текущее значение столбцов

}
 

/*******************************************************************************
*
*@begin
* NAME: plt_CCGetPosition
*
* Gets the display position for data writes.
*
* Returns :  void
*
* Parameter    Flow    Description
* ------------------------------------------------------------------------------
-
* Row           OUT     Current Row
* Column        OUT     Current Column
*
* Externals    Flow    Usage
* ------------------------------------------------------------------------------
-
*
* Additional information:
*
*@end
********************************************************************************/
void plt_CCGetPosition(Byte   *Row, Byte   *Column) 
{

	* Row    = CCRows;
	* Column = CCColumn;
}


/*******************************************************************************
* NAME: plt_CCSetOverline
*
*  
*
* Returns :  void
*
* Parameter    Flow    Description
* -------------------------------------------------------------------------------
* Mode          IN       
*
* Externals    Flow    Usage
* -------------------------------------------------------------------------------
********************************/

void plt_CCSetOverline(Bool Mode)
{
Mode  = Mode;
}
/*******************************************************************************
* NAME: plt_CCSetUnderline
*
*  
*
* Returns :  void
*
* Parameter    Flow    Description
* -------------------------------------------------------------------------------
* Mode          IN       
*
* Externals    Flow    Usage
* -------------------------------------------------------------------------------
********************************/

void plt_CCSetUnderline(Bool Mode)
{
Mode = Mode;
}



/********************************************************************************
* NAME: plt_CCSetBackgroundColour
*
* Returns :  void
*
* Parameter             Flow    Description
* -------------------------------------------------------------------------------
* BackgroundColour      IN      Colour to be set as the background
* SetAt                 IN      Flag to indicate when the attribute should take effect
*
* Externals    Flow    Usage
* -------------------------------------------------------------------------------
*
* Additional information:
*
*
*
*@end
**********************************************************************************/ 
void  plt_CCSetBackgroundColour(Byte BackgroundColour, Byte SetAt) 
{
 	  BackgroundColour = BackgroundColour&0x0F;

  if( SetAt == TRUE)/* SetAt = 1     */
   {
      BackgroundColour = 0;

   }

 
}
/********************************************************************************
*@begin
* NAME: plt_CCSetForegroundColour
*
* Sets the required foreground colour for characters to be written in
*
* Returns :  void
*
* Parameter    Flow    Description
* -------------------------------------------------------------------------------
* ForegroundColour      IN      Colour to be set as the foreground
*
* Externals    Flow    Usage
* -------------------------------------------------------------------------------
*
* Additional information:
*
*@end
********************************************************************************/ 

void plt_CCSetForegroundColour(Byte ForegroundColour) 
{
  ForegroundColour = ForegroundColour&0x7;
}

/******************************************************************************* 
*
*
*
*
********************************************************************************/ 
/**
void plt_CCInstForegroundColour(Byte ForegroundColour) 
{
  ForegroundColour = ForegroundColour;
}
***/
/*******************************************************************************
* NAME: plt_CCDrawChar
*  Оторажает символ на экране
* Returns :  void
*
* Параметр    Вх/Вых    Описание
* ------------------------------------------------------------------------------
* Character     IN      Символ записанный к отображению
*
* Externals    Flow    Usage
*******************************************************************************/

void plt_CCDrawChar(char Character)    
{
  if(Character!=0) //test
     CCColumn++;      // Текущее значение столбцов
}
 
/**********************************************************************************
* NAME: plt_CCSetBoxBackground
*
* Turns background boxing on/off
*
* Returns :  void
*
* Parameter    Flow    Description
* -------------------------------------------------------------------------------
* Mode          IN      Флаг, чтобы указать, боксировал ли фон.
* SetAt         IN      Флаг, чтобы указать, когда признак должен вступить в силу
*
***********************************************************************************/ 
  void  plt_CCSetBoxBackground(Byte Mode, Byte SetAt) 
{

	Mode = Mode&0x01;

  if( SetAt == TRUE )/*    SetAt  */
   {
 Mode = 0;

   }

 
} 

/**********************************************************************************
*
*
***********************************************************************************/
void MY_plt_CCSetPosition(Byte Row, Byte Column)
{
  CCRows = Row&0x3F;     // Текущее значение строк
  CCColumn = Column;    // Текущее значение столбцов
}


