/*
 * auph.h
 *
 *  Created on: 24 февр. 2026 г.
 *      Author: priss
 */

#ifndef UI_INC_AUPH_H_
#define UI_INC_AUPH_H_

/*==========================================================================*/
/*        I N C L U D E S                                                   */
/*==========================================================================*/
#include "hglobal.h"
#include "aukh.h"
/*==========================================================================*/
/*        L O C A L   D A T A   C O N F I G U R A T I O N                   */
/*==========================================================================*/


/*==========================================================================*/
/*        L O C A L   F U N C T I O N   P R O T O T Y P E S                 */
/*==========================================================================*/

/*==========================================================================*/
/*        L O C A L   D A T A   D E C L A R A T I O N S                     */
/*==========================================================================*/

/*=======================================================================*/
/*    G L O B A L   D A T A   D E C L A R A T I O N S                    */
/*=======================================================================*/
/*==========================================================================*/
/*
   @type aukh_current |
         Содержит последнюю  клавишу  прочтитанню от локальной клавиатуры или дистанционного управления
         что в настоящее время обрабатывается.
         Это установлено в неактивный, когда команда была обработана.
*/
extern AU_COMMAND  au_current ;/*Содержит текущую прочитанню клавишу
                                       от дистанционного управления или
                                       локальная клавиатура.
                                       Эта переменная также содержит
                                       бит переключения при удержании кнопки. */

/*==========================================================================*/
/*
   @type au_direction |
         Определяет  направление y AUKH_UP или AUKH_DOWN.

      Если текщая команда четная    aukh_direction = TRUE;
      Если текщая команда нечетная  aukh_direction = FALSE;
*/
extern Bool au_direction;

/*=======================================================================*/
/*    G L O B A L   F U N C T I O N P R O T O T Y P E S                  */
/*=======================================================================*/

extern void auph_SetState(auphTvState_enum new_state) ;
extern auphTvState_enum auph_GetState(void);
extern void auph_ProcessKey(void) ;

#endif /* UI_INC_AUPH_H_ */
